[{"data":1,"prerenderedAt":35},["Reactive",2],{"search-api":3},[4,11,19,27],{"id":5,"path":6,"dir":7,"title":8,"description":7,"keywords":9,"body":10},"content:0.index.md","/","","Home",[],"     Livello Applicativo dell'ISO/OSI.   Questa relazione ti spiegerà i seguenti concetti del livello applicativo:     I Protocolli principali ed il loro funzionamento  Il modello   client  /   server  I Protocolli   FTP ,   Email ,   DNS ,   HTTP  in dettaglio",{"id":12,"path":13,"dir":14,"title":15,"description":16,"keywords":17,"body":18},"content:1.teoria:1.database.md","/teoria/database","teoria","Database","From your Markdown files to a deployed website in few minutes.",[],"  Database  From your Markdown files to a deployed website in few minutes.",{"id":20,"path":21,"dir":14,"title":22,"description":23,"keywords":24,"body":26},"content:1.teoria:2.dbms.md","/teoria/dbms","DBMS","Un Database Management System (DBMS) è un software progettato per creare, gestire e facilitare l'accesso e l'uso di un database. La sua funzione principale è consentire agli utenti di interagire con il database in modo efficiente, fornendo strumenti per l'inserimento, l'aggiornamento, la gestione e l'interrogazione dei dati.",[25],"Caratteri di un DBMS","  DBMS  Un Database Management System (DBMS) è un software progettato per creare, gestire e facilitare l'accesso e l'uso di un database. La sua funzione principale è consentire agli utenti di interagire con il database in modo efficiente, fornendo strumenti per l'inserimento, l'aggiornamento, la gestione e l'interrogazione dei dati.  Caratteri di un DBMS  This is the minimal directory structure to get an up and running Docus website.",{"id":28,"path":29,"dir":30,"title":31,"description":32,"keywords":33,"body":34},"content:2.pratica:1.configurazione.md","/pratica/configurazione","pratica","Configurazione","Discover every component you can use in your content.",[],"  Configurazione  Discover every component you can use in your content.",1700594176786]