[{"data":1,"prerenderedAt":38},["Reactive",2],{"search-api":3},[4,11,22,30],{"id":5,"path":6,"dir":7,"title":8,"description":7,"keywords":9,"body":10},"content:0.index.md","/","","Home",[],"     Livello Applicativo dell'ISO/OSI.   Questa relazione ti spiegerà i seguenti concetti del livello applicativo:     I Protocolli principali ed il loro funzionamento  Il modello   client  /   server  I Protocolli   FTP ,   Email ,   DNS ,   HTTP  in dettaglio",{"id":12,"path":13,"dir":14,"title":15,"description":16,"keywords":17,"body":21},"content:1.teoria:1.database.md","/teoria/database","teoria","Database","Le basi di dati, o database, sono archivi di dati organizzati e progettati con tecniche di modellazione dati, gestiti su memorie di massa dei computer attraverso software specializzati. L'obiettivo è manipolare e recuperare i dati in modo efficiente, superando le limitazioni degli archivi tradizionali.",[18,19,20],"I Record e i Campi","Chiave Primaria","Proprietà di un DB","  Database  Le basi di dati, o database, sono archivi di dati organizzati e progettati con tecniche di modellazione dati, gestiti su memorie di massa dei computer attraverso software specializzati. L'obiettivo è manipolare e recuperare i dati in modo efficiente, superando le limitazioni degli archivi tradizionali.    I Record e i Campi  Un file è una collezione di   record , cioè di informazioni logicamente omogenee che\ndescrivono i singoli elementi di una realtà considerata. Ogni record è composto da un insieme di   campi  che contengono i valori assunti dalle caratteristiche scelte per descrivere la realtà.    Chiave Primaria  Una chiave primaria in un database è un campo o un insieme di campi che identifica univocamente ogni record in una tabella. La sua principale caratteristica è la sua unicità all'interno della tabella, garantendo che ogni riga abbia un valore unico per la chiave primaria. Inoltre, la chiave primaria non può contenere valori nulli, e viene utilizzata per stabilire relazioni tra tabelle all'interno del database.  Proprietà di un DB      Eliminazione della ridondanza e dell'inconsistenza : I dati non sono duplicati in archivi separati, evitando campi uguali con valori diversi.   Facilità di accesso ai dati : Il recupero dei dati è rapido e trasparente, anche in database di grandi dimensioni con richieste simultanee da parte di più utenti.   Interrogazioni non predefinite : È possibile interrogare i dati con un linguaggio semplice e standard, facilitando la costruzione di nuove interrogazioni.   Integrità dei dati : I vincoli di integrità sono memorizzati e controllati dal Database Management System (DBMS), garantendo la coerenza dei dati e prevenendo anomalie.   Indipendenza dalla struttura logica e fisica dei dati : I programmi applicativi sono indipendenti dalla struttura logica dei dati, consentendo modifiche alla definizione delle strutture della base di dati senza alterare il software applicativo.   Utilizzo da più utenti e controllo della concorrenza : Il database può essere utilizzato da più utenti contemporaneamente, e il DBMS gestisce le operazioni in modo che non interferiscano tra loro.   Sicurezza dei dati : Vengono implementate procedure di controllo per prevenire accessi non autorizzati e proteggere i dati da guasti accidentali.",{"id":23,"path":24,"dir":14,"title":25,"description":26,"keywords":27,"body":29},"content:1.teoria:2.dbms.md","/teoria/dbms","DBMS","Un Database Management System (DBMS) è un software progettato per creare, gestire e facilitare l'accesso e l'uso di un database. La sua funzione principale è consentire agli utenti di interagire con il database in modo efficiente, fornendo strumenti per l'inserimento, l'aggiornamento, la gestione e l'interrogazione dei dati.",[28],"Caratteri di un DBMS","  DBMS  Un Database Management System (DBMS) è un software progettato per creare, gestire e facilitare l'accesso e l'uso di un database. La sua funzione principale è consentire agli utenti di interagire con il database in modo efficiente, fornendo strumenti per l'inserimento, l'aggiornamento, la gestione e l'interrogazione dei dati.  Caratteri di un DBMS  This is the minimal directory structure to get an up and running Docus website.",{"id":31,"path":32,"dir":33,"title":34,"description":35,"keywords":36,"body":37},"content:2.pratica:1.configurazione.md","/pratica/configurazione","pratica","Configurazione","Discover every component you can use in your content.",[],"  Configurazione  Discover every component you can use in your content.",1700594300642]